000000*    更新日付
000000     cpFile-UPDATE                   PIC   X(008)
000000*    かマン1
000000     cpFile-KANMAN1                    PIC   X(001)
000000*    亜
000000     cpFile-AAA                   PIC   X(016)
000000*    かマン2
000000     cpFile-KANMAN2                    PIC   X(001)
000000*    生
000000     cpFile-IKI                   PIC   X(040)
000000*    かマン3
000000     cpFile-KANMAN3                    PIC   X(001)
000000*    名前
000000     cpFile-NAME                   PIC   X(001)
000000*    かマン4
000000     cpFile-KANMAN4                    PIC   X(001)
000000*    年齢的
000000     cpFile-NEIREI                   PIC   S9(002)
000000*    かマン5
000000     cpFile-KANMAN5                    PIC   X(001)
000000*    何
000000     cpFile-NANNN                   PIC   S9(006)
000000*    かマン6
000000     cpFile-KANMAN6                    PIC   X(001)
