
/*
 *
 *1. 抽象
 *   类型 ：所抽象的是什么
 *          有状态，行为（属性，动作）
 *   对象 ：问题空间的元素及其在解空间的表示
 *          -------             ------
 *                              基于计算机
 *   OOP ： 根据问题来描述问题
 *          万物皆为对象
 *          程序是对象的集合，对象通过消息相互通信
 *          每个对象自己的由其他对象所构成的存储
 *          每个对象都拥有类型 class的一个instance
 *          某一特定类型的所有对象都可以接受同样的消息
 *
 *2.接口
 *   每个对象都有一个接口
 *   抽象数据类型（类），描述了具有相同特性和行为的对象集合，
 *   一个类实际上就是一个数据类型，一个对象集合上的约束条件
 *   类型反之也是一个类，比如浮点型数字具有相同的特性和行为集合。
 *
 *   定义类来适应问题，而不是被迫只能使用现有的用来表示机器中的存储单元的数据类型。
 *
 *   ***OOP的挑战之一，问题空间的元素和解空间的对象之间创建一对一的映射
 *   
 *   某种方式产生对对象的请求，是对象完成各种任务。
 *   请求由对象 接口interface 所定义，决定接口的便是类型。
 *   
 *3.服务提供者
 *   能够提供服务来解决问题的一系列对象
 *
 *4.实现
 *  访问控制
 *  组合has-a
 *  继承is-a
 *
 *  
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 *
 */
